<?php

return [
    'message' => [
        'start' => 'Финаснсовые услуги:',
        'services' => 'Выберите необходимую услугу:',
        'city' => 'Выберите город:',
        'service_type' => 'Тип услуги:',
        'crypto_type' => 'Выберите криптовалюту:',
        'currency' => 'Выберите валюту:',
        'amount' => 'Укажите желаемую сумму:',
        'currency_type' => 'Выберите тип валюты:',
        'custom_currency' => 'Укажите желаюмую валюту:',
        'crypto_sell' => 'Укажите желаюмую валюту:',
    ],
    'button' => [
        'individuals' => '👨 Частным лицам',
        'legal_entities' => '🏬 Юридическим лицам',

        'currency_exchange' => '💰Обмен валюты',
        'crypto_exchange' => '🪙 Обмен криптовалюты',
        'international_transfers' => '🏧 Международные переводы',
        'payment_invoices' => '📜 Оплата инвойсов',
        'return_foreign_currency_revenue' => '🏪 Возврат валютной выручки',
        'payment_agency_agreement' => '🚢 Платежи для импортеров по агентскому договору',
        'business_relocation' => '🏢 Релокация бизнеса',

        'usd' => '💵 дол. США',
        'eur' => '💶 Евро',
        'custom_currency' => '💴 Свой вариант',

        'btc' => '🪙 BTC',
        'eth' => '🪙 ETH',
        'usdt' => '🪙 USDT',

        'moscow' => '🌆 Москва',
        'simferopol' => '🌆 Симферополь',
        'sevastopol' => '🌆 Севастополь',

        'buy' => '⬆ Купить',
        'sell' => '⬇ Продать',

        'new_usd_banknote' => '🔵 Нового образца - Синий',
        'old_usd_banknote' => '⚪ Старого образца - Белый',

        'checkout' => '✅ Подвердить заказ',
        'completed' => '✅ Выполнена',
        'back' => '⬅ Назад',
    ],
    'order' => [
        'start' => 'Финаснсовые услуги:',
        'services' => 'Услуга:',
        'city' => 'Город:',
        'service_type' => 'Тип услуги:',
        'currency' => 'Валюта:',
        'amount' => 'Cумма:',
        'currency_type' => 'Тип валюты:',
        'crypto_type' => 'Тип криптовалюты:',
    ],
    'errors' => [
        'not_numeric' => '🤷 Ввведите пожалуйста числовое значение:',
        'invalid_amount' => '🤷 Сумма должна быть не меньше :amount. Повторите пожалуйста ввод.'
    ]
];
